In [1]:
import pandas as pd

dict1 = {'Name': ['John', 'Emily', 'Sophia', 'Michael', 'David', 'Emma', 'Olivia'],
         'Marks': [98, 89, 99, 87, 90, 83, 99],
         'Gender': ["Male", "Female", "Female", "Male", "Male", "Female", "Female"]}

df1 = pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0     John     98    Male
1    Emily     89  Female
2   Sophia     99  Female
3  Michael     87    Male
4    David     90    Male
5     Emma     83  Female
6   Olivia     99  Female

In [2]:
df1.head()

      Name  Marks  Gender
0     John     98    Male
1    Emily     89  Female
2   Sophia     99  Female
3  Michael     87    Male
4    David     90    Male

In [4]:
df1.tail()

      Name  Marks  Gender
2   Sophia     99  Female
3  Michael     87    Male
4    David     90    Male
5     Emma     83  Female
6   Olivia     99  Female

In [11]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [12]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [13]:
df1.columns.tolist()

['Name', 'Marks', 'Gender']

In [23]:
df1.index.tolist()

[0, 1, 2, 3, 4, 5, 6]

In [19]:
df1.value_counts()

Name     Marks  Gender
David    90     Male      1
Emily    89     Female    1
Emma     83     Female    1
John     98     Male      1
Michael  87     Male      1
Olivia   99     Female    1
Sophia   99     Female    1
Name: count, dtype: int64

In [24]:
df1.head

<bound method NDFrame.head of       Name  Marks  Gender
0     John     98    Male
1    Emily     89  Female
2   Sophia     99  Female
3  Michael     87    Male
4    David     90    Male
5     Emma     83  Female
6   Olivia     99  Female>

In [27]:
df1["Name"].unique()

array(['John', 'Emily', 'Sophia', 'Michael', 'David', 'Emma', 'Olivia'],
      dtype=object)

In [28]:
df1["Name"].nunique()

7

In [29]:
df1["Name"].value_counts()

Name
John       1
Emily      1
Sophia     1
Michael    1
David      1
Emma       1
Olivia     1
Name: count, dtype: int64

In [30]:
df1.shape

(7, 3)

In [32]:
df1.size

21

In [36]:
df1.head()

      Name  Marks  Gender
0     John     98    Male
1    Emily     89  Female
2   Sophia     99  Female
3  Michael     87    Male
4    David     90    Male

In [37]:
df1.loc[:, "Marks"] = 100

In [38]:
df1.head()

      Name  Marks  Gender
0     John    100    Male
1    Emily    100  Female
2   Sophia    100  Female
3  Michael    100    Male
4    David    100    Male

In [39]:
df1.iloc[:, 1] = 99

In [41]:
df1.head()

      Name  Marks  Gender
0     John     99    Male
1    Emily     99  Female
2   Sophia     99  Female
3  Michael     99    Male
4    David     99    Male

In [42]:
df1.sort_values(by="Name")

      Name  Marks  Gender
4    David     99    Male
1    Emily     99  Female
5     Emma     99  Female
0     John     99    Male
3  Michael     99    Male
6   Olivia     99  Female
2   Sophia     99  Female

In [48]:
for index, rows in df1.iterrows():
    print(index)
    print(rows)
    print()

0
Name      John
Marks       99
Gender    Male
Name: 0, dtype: object

1
Name       Emily
Marks         99
Gender    Female
Name: 1, dtype: object

2
Name      Sophia
Marks         99
Gender    Female
Name: 2, dtype: object

3
Name      Michael
Marks          99
Gender       Male
Name: 3, dtype: object

4
Name      David
Marks        99
Gender     Male
Name: 4, dtype: object

5
Name        Emma
Marks         99
Gender    Female
Name: 5, dtype: object

6
Name      Olivia
Marks         99
Gender    Female
Name: 6, dtype: object

In [49]:
df1.head()

      Name  Marks  Gender
0     John     99    Male
1    Emily     99  Female
2   Sophia     99  Female
3  Michael     99    Male
4    David     99    Male

In [50]:
df = df1.copy()

In [51]:
df.head()

      Name  Marks  Gender
0     John     99    Male
1    Emily     99  Female
2   Sophia     99  Female
3  Michael     99    Male
4    David     99    Male

In [54]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [55]:
df.duplicated().sum()

np.int64(0)

In [58]:
df.drop_duplicates()

      Name  Marks  Gender
0     John     99    Male
1    Emily     99  Female
2   Sophia     99  Female
3  Michael     99    Male
4    David     99    Male
5     Emma     99  Female
6   Olivia     99  Female

In [59]:
df.isna()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [60]:
df.notna()

   Name  Marks  Gender
0  True   True    True
1  True   True    True
2  True   True    True
3  True   True    True
4  True   True    True
5  True   True    True
6  True   True    True

In [61]:
df.isna().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [62]:
df.notna().sum()

Name      7
Marks     7
Gender    7
dtype: int64

In [63]:
import numpy as np

df.head()

      Name  Marks  Gender
0     John     99    Male
1    Emily     99  Female
2   Sophia     99  Female
3  Michael     99    Male
4    David     99    Male

In [65]:
df.loc[3, "Gender"] = np.nan

In [66]:
df.head()

      Name  Marks  Gender
0     John     99    Male
1    Emily     99  Female
2   Sophia     99  Female
3  Michael     99     NaN
4    David     99    Male

In [69]:
df.dropna(inplace=True)

In [70]:
df.head(100)

     Name  Marks  Gender
0    John     99    Male
1   Emily     99  Female
2  Sophia     99  Female
4   David     99    Male
5    Emma     99  Female
6  Olivia     99  Female

In [72]:
df["Last Name"] = ["Scott", "Murphy", "Edward", "Goggins", "Trump", "Rodrigo"]

In [74]:
df.head()

     Name  Marks  Gender Last Name
0    John     99    Male     Scott
1   Emily     99  Female    Murphy
2  Sophia     99  Female    Edward
4   David     99    Male   Goggins
5    Emma     99  Female     Trump

In [77]:
df["Full Name"] = df["Name"] + " " + df["Last Name"]

In [78]:
df.head()

     Name  Marks  Gender Last Name      Full Name
0    John     99    Male     Scott     John Scott
1   Emily     99  Female    Murphy   Emily Murphy
2  Sophia     99  Female    Edward  Sophia Edward
4   David     99    Male   Goggins  David Goggins
5    Emma     99  Female     Trump     Emma Trump

In [79]:
df = df[["Name", "Last Name", "Marks", "Gender", "Full Name"]]

In [80]:
df.head()

     Name Last Name  Marks  Gender      Full Name
0    John     Scott     99    Male     John Scott
1   Emily    Murphy     99  Female   Emily Murphy
2  Sophia    Edward     99  Female  Sophia Edward
4   David   Goggins     99    Male  David Goggins
5    Emma     Trump     99  Female     Emma Trump

In [82]:
df = df.rename(columns={"Name":"First Name"})

In [83]:
df

  First Name Last Name  Marks  Gender       Full Name
0       John     Scott     99    Male      John Scott
1      Emily    Murphy     99  Female    Emily Murphy
2     Sophia    Edward     99  Female   Sophia Edward
4      David   Goggins     99    Male   David Goggins
5       Emma     Trump     99  Female      Emma Trump
6     Olivia   Rodrigo     99  Female  Olivia Rodrigo

In [85]:
df["F Name"] = df["Full Name"].str.split(" ").str[0]

In [86]:
df

  First Name Last Name  Marks  Gender       Full Name  F Name
0       John     Scott     99    Male      John Scott    John
1      Emily    Murphy     99  Female    Emily Murphy   Emily
2     Sophia    Edward     99  Female   Sophia Edward  Sophia
4      David   Goggins     99    Male   David Goggins   David
5       Emma     Trump     99  Female      Emma Trump    Emma
6     Olivia   Rodrigo     99  Female  Olivia Rodrigo  Olivia

In [87]:
df["L Name"] = df["Full Name"].str.split("a").str[1]

In [88]:
df

  First Name Last Name  Marks  Gender       Full Name  F Name       L Name
0       John     Scott     99    Male      John Scott    John          NaN
1      Emily    Murphy     99  Female    Emily Murphy   Emily          NaN
2     Sophia    Edward     99  Female   Sophia Edward  Sophia          Edw
4      David   Goggins     99    Male   David Goggins   David  vid Goggins
5       Emma     Trump     99  Female      Emma Trump    Emma        Trump
6     Olivia   Rodrigo     99  Female  Olivia Rodrigo  Olivia      Rodrigo

In [91]:
df.drop(columns="L Name", axis = 1, inplace=True)

In [92]:
df.drop(columns="F Name", axis = 1, inplace=True)

In [93]:
df

  First Name Last Name  Marks  Gender       Full Name
0       John     Scott     99    Male      John Scott
1      Emily    Murphy     99  Female    Emily Murphy
2     Sophia    Edward     99  Female   Sophia Edward
4      David   Goggins     99    Male   David Goggins
5       Emma     Trump     99  Female      Emma Trump
6     Olivia   Rodrigo     99  Female  Olivia Rodrigo

In [95]:
print("Number of rows : ", df.shape[0])

Number of rows :  6

In [96]:
print("Number of columns : ", df.shape[1])

Number of columns :  5

In [97]:
df.isna()

   First Name  Last Name  Marks  Gender  Full Name
0       False      False  False   False      False
1       False      False  False   False      False
2       False      False  False   False      False
4       False      False  False   False      False
5       False      False  False   False      False
6       False      False  False   False      False

In [98]:
df.notna()

   First Name  Last Name  Marks  Gender  Full Name
0        True       True   True    True       True
1        True       True   True    True       True
2        True       True   True    True       True
4        True       True   True    True       True
5        True       True   True    True       True
6        True       True   True    True       True

In [99]:
df.isnull()

   First Name  Last Name  Marks  Gender  Full Name
0       False      False  False   False      False
1       False      False  False   False      False
2       False      False  False   False      False
4       False      False  False   False      False
5       False      False  False   False      False
6       False      False  False   False      False

In [100]:
df1.head()

      Name  Marks  Gender
0     John     99    Male
1    Emily     99  Female
2   Sophia     99  Female
3  Michael     99    Male
4    David     99    Male

In [101]:
df1["Gender"].unique()

array(['Male', 'Female'], dtype=object)

In [102]:
df1["Gender"].unique().tolist()

['Male', 'Female']

In [103]:
df1["Gender"].nunique()

2

In [104]:
df1["Gender"].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [107]:
df["Marks"] = [98, 89, 99, 87, 90, 83]

In [108]:
df

  First Name Last Name  Marks  Gender       Full Name
0       John     Scott     98    Male      John Scott
1      Emily    Murphy     89  Female    Emily Murphy
2     Sophia    Edward     99  Female   Sophia Edward
4      David   Goggins     87    Male   David Goggins
5       Emma     Trump     90  Female      Emma Trump
6     Olivia   Rodrigo     83  Female  Olivia Rodrigo

In [109]:
df["Gender"].value_counts()

Gender
Female    4
Male      2
Name: count, dtype: int64

In [110]:
df["First Name"].value_counts()

First Name
John      1
Emily     1
Sophia    1
David     1
Emma      1
Olivia    1
Name: count, dtype: int64

In [113]:
df[(df["Marks"] >= 90) & (df["Marks"]<=100)] # Wow and as a string form does not work here

  First Name Last Name  Marks  Gender      Full Name
0       John     Scott     98    Male     John Scott
2     Sophia    Edward     99  Female  Sophia Edward
5       Emma     Trump     90  Female     Emma Trump

In [123]:
df[(df["Marks"] >= 90) & (df["Marks"]<=100)].shape[0]

3

In [124]:
df[(df["Marks"] >= 90) & (df["Marks"]<=100)]

  First Name Last Name  Marks  Gender      Full Name
0       John     Scott     98    Male     John Scott
2     Sophia    Edward     99  Female  Sophia Edward
5       Emma     Trump     90  Female     Emma Trump

In [128]:
a = df["Marks"]>=90
b = df["Marks"]<=100

print((a & b).sum())

3

In [130]:
len(df[(df["Marks"]>=90) & (df["Marks"]<=100)])

3

In [133]:
df["Marks"].between(90,100)

0     True
1    False
2     True
4    False
5     True
6    False
Name: Marks, dtype: bool

In [134]:
sum(df["Marks"].between(90,100))

3

In [136]:
df.describe()

           Marks
count   6.000000
mean   91.000000
std     6.292853
min    83.000000
25%    87.500000
50%    89.500000
75%    96.000000
max    99.000000

In [138]:
df["Marks"].mean()

np.float64(91.0)

In [139]:
int(df["Marks"].mean())

91

In [140]:
df["Marks"].min()

83

In [141]:
df["Marks"].max()

99

In [145]:
df["Marks Divided by 2"] = df["Marks"]/2

In [146]:
df.head()

  First Name Last Name  Marks  Gender      Full Name  Marks Divided by 2
0       John     Scott     98    Male     John Scott                49.0
1      Emily    Murphy     89  Female   Emily Murphy                44.5
2     Sophia    Edward     99  Female  Sophia Edward                49.5
4      David   Goggins     87    Male  David Goggins                43.5
5       Emma     Trump     90  Female     Emma Trump                45.0

In [148]:
df["Marks"] = df["Marks"].apply(lambda x:x//2)

In [150]:
df.head()

  First Name Last Name  Marks  Gender      Full Name  Marks Divided by 2
0       John     Scott     49    Male     John Scott                49.0
1      Emily    Murphy     44  Female   Emily Murphy                44.5
2     Sophia    Edward     49  Female  Sophia Edward                49.5
4      David   Goggins     43    Male  David Goggins                43.5
5       Emma     Trump     45  Female     Emma Trump                45.0

In [151]:
df.drop("Marks Divided by 2", axis = 1, inplace=True)

In [152]:
df.head()

  First Name Last Name  Marks  Gender      Full Name
0       John     Scott     49    Male     John Scott
1      Emily    Murphy     44  Female   Emily Murphy
2     Sophia    Edward     49  Female  Sophia Edward
4      David   Goggins     43    Male  David Goggins
5       Emma     Trump     45  Female     Emma Trump

In [153]:
df["Marks"] = df["Marks"] * 2

In [214]:
df.head()

  First Name Last Name  Marks  Gender      Full Name
0       John     Scott     30    Male     John Scott
1      Emily    Murphy     25  Female   Emily Murphy
2     Sophia    Edward     30  Female  Sophia Edward
4      David   Goggins     25    Male  David Goggins
5       Emma     Trump     25  Female     Emma Trump

In [215]:
def marks(x):
    return int(x * 3)

In [216]:
df["Marks"] = df["Marks"].apply(marks)

In [217]:
df.head()

  First Name Last Name  Marks  Gender      Full Name
0       John     Scott     90    Male     John Scott
1      Emily    Murphy     75  Female   Emily Murphy
2     Sophia    Edward     90  Female  Sophia Edward
4      David   Goggins     75    Male  David Goggins
5       Emma     Trump     75  Female     Emma Trump

In [218]:
df["Marks"] = [100, 50, 70, 45, 67, 25]

In [219]:
df.head()

  First Name Last Name  Marks  Gender      Full Name
0       John     Scott    100    Male     John Scott
1      Emily    Murphy     50  Female   Emily Murphy
2     Sophia    Edward     70  Female  Sophia Edward
4      David   Goggins     45    Male  David Goggins
5       Emma     Trump     67  Female     Emma Trump

In [230]:
df["IQ"] = df["Marks"].apply(lambda x: "Smart" if x > 90 else ( "Intermediate" if x >50 else "Lazy"))

In [231]:
df.head()

  First Name Last Name  Marks  Gender      Full Name            IQ
0       John     Scott    100    Male     John Scott         Smart
1      Emily    Murphy     50  Female   Emily Murphy          Lazy
2     Sophia    Edward     70  Female  Sophia Edward  Intermediate
4      David   Goggins     45    Male  David Goggins          Lazy
5       Emma     Trump     67  Female     Emma Trump  Intermediate

In [233]:
df["Gender"] = df["Gender"].map({"Male":0, "Female":1})

In [234]:
df.head()

  First Name Last Name  Marks  Gender      Full Name            IQ
0       John     Scott    100       0     John Scott         Smart
1      Emily    Murphy     50       1   Emily Murphy          Lazy
2     Sophia    Edward     70       1  Sophia Edward  Intermediate
4      David   Goggins     45       0  David Goggins          Lazy
5       Emma     Trump     67       1     Emma Trump  Intermediate

In [238]:
df.drop(["Full Name", "IQ"], axis = 1)

  First Name Last Name  Marks  Gender
0       John     Scott    100       0
1      Emily    Murphy     50       1
2     Sophia    Edward     70       1
4      David   Goggins     45       0
5       Emma     Trump     67       1
6     Olivia   Rodrigo     25       1

In [252]:
for i, r in df.iterrows():
    print(i, ": " + "My name is ", r["First Name"])

0 : My name is  John
1 : My name is  Emily
2 : My name is  Sophia
4 : My name is  David
5 : My name is  Emma
6 : My name is  Olivia

In [254]:
df["Marks"].sort_values()

6     25
4     45
1     50
5     67
2     70
0    100
Name: Marks, dtype: int64

In [259]:
df.sort_values(by=["Marks","First Name"])

  First Name Last Name  Marks  Gender       Full Name            IQ
6     Olivia   Rodrigo     25       1  Olivia Rodrigo          Lazy
4      David   Goggins     45       0   David Goggins          Lazy
1      Emily    Murphy     50       1    Emily Murphy          Lazy
5       Emma     Trump     67       1      Emma Trump  Intermediate
2     Sophia    Edward     70       1   Sophia Edward  Intermediate
0       John     Scott    100       0      John Scott         Smart

In [265]:
df[["Marks", "First Name"]].sort_values(by=["Marks","First Name"], ascending=False)

   Marks First Name
0    100       John
2     70     Sophia
5     67       Emma
1     50      Emily
4     45      David
6     25     Olivia

In [263]:
df.sort_values(["Marks", "First Name"], ascending=[True, False])

  First Name Last Name  Marks  Gender       Full Name            IQ
6     Olivia   Rodrigo     25       1  Olivia Rodrigo          Lazy
4      David   Goggins     45       0   David Goggins          Lazy
1      Emily    Murphy     50       1    Emily Murphy          Lazy
5       Emma     Trump     67       1      Emma Trump  Intermediate
2     Sophia    Edward     70       1   Sophia Edward  Intermediate
0       John     Scott    100       0      John Scott         Smart

In [266]:
df["Gender"].isin(["Female"])

0    False
1    False
2    False
4    False
5    False
6    False
Name: Gender, dtype: bool

In [278]:
df[df["IQ"]== "Lazy"]["First Name"]

1     Emily
4     David
6    Olivia
Name: First Name, dtype: object

In [280]:
df[df["IQ"]== "Lazy"][["First Name","Marks"]]

  First Name  Marks
1      Emily     50
4      David     45
6     Olivia     25

In [284]:
df[df["IQ"].isin(["Lazy"])]

3

In [285]:
len(df[df["IQ"].isin(["Lazy"])])

3

In [288]:
df[df["IQ"].isin(["Lazy"])].count()

First Name    3
Last Name     3
Marks         3
Gender        3
Full Name     3
IQ            3
dtype: int64